app/Http/Controllers/CampaignController.php

    public function dataTable(Request $request)
    {
        $categoryID = $request->input('category_id');

        $campaign = Campaign::with('category')
            ->when($categoryID, function ($query, $categoryID) {
                return $query->where('category_id', $categoryID);
            })
            ->select('id', 'category_id', 'is_enabled', 'name', 'start_at', 'end_at', 'amount')
            ->get();
---
SELECT * FROM `categories` WHERE `categories`.`id` in (1, 7)
SELECT `id`, `category_id`, `is_enabled`, `name`, `start_at`, `end_at`, `amount` FROM `campaigns`

    public function create()
    {
        $categoryType = Category::pluck('name', 'id');
        $productType = Product::pluck('name', 'id');
---
SELECT `name`, `id` FROM `categories`
SELECT `name`, `id` FROM `products`

    public function store(Request $request)
    {
        $attributes = $request->validate([
            'category_id' => 'required',
            'name' => 'required',
            'is_enabled' => 'required',
            'start_at' => 'required',
            'end_at' => 'required',
            'amount' => 'required'
        ]);

        $campaign = Campaign::create($attributes);

        $productIds = $request->input('products', []);

        $campaign->products()->sync($productIds);
---
INSERT INTO `campaigns` (`category_id`, `name`, `is_enabled`, `start_at`, `end_at`, `amount`, `updated_at`, `created_at`) VALUES ('2', 'CastrolOil123', '1', '2023-06-22', '2023-07-21', '21', '2023-06-20 10:38:56', '2023-06-20 10:38:56')
INSERT INTO `campaign_products` (`campaign_id`, `product_id`, `updated_at`, `created_at`) VALUES (33, '1', '2023-06-19 12:05:12', '2023-06-19 12:05:12')

    public function edit(Campaign $campaign)
    {
        $selectedProducts = $campaign->products->pluck('id')->toArray();

        $categoryID = $campaign->category_id;
        $categoryType = Category::pluck('name', 'id');
        $productType = Product::pluck('name', 'id');
---
SELECT `products`.*, `campaign_products`.`campaign_id` as `pivot_campaign_id`, `campaign_products`.`product_id` as `pivot_product_id` FROM `products` inner join `campaign_products` on `products`.`id` = `campaign_products`.`product_id` WHERE `campaign_products`.`campaign_id` = 2
SELECT `name`, `id` FROM `categories`
SELECT `name`, `id` FROM `products`

    public function update(Request $request, Campaign $campaign)
    {
        $attributes = $request->validate([
            'category_id' => 'required',
            'name' => 'required',
            'is_enabled' => 'required',
            'start_at' => 'required',
            'end_at' => 'required',
            'amount' => 'required'
        ]);

        $campaign->update($attributes);

        $productIds = $request->input('products', []);

        $campaign->products()->sync($productIds);
---
UPDATE `campaigns` SET `name` = 'ads', `campaigns`.`updated_at` = '2023-06-20 07:20:58' WHERE `id` = 33
INSERT INTO `campaign_products` (`campaign_id`, `product_id`) VALUES (10, 1)
DELETE FROM `campaign_products` WHERE `campaign_products`.`campaign_id` = 2 and `campaign_products`.`campaign_id` IS not NULL

    public function destroy(Campaign $campaign)
    {
        $campaign->delete();
---
DELETE FROM `campaigns` WHERE `id` = 4