app/Http/Controllers/CategoryController.php

SELECT `id`, `name` FROM `categories`
---
    public function dataTable()
    {
        $categories = Category::select('id', 'name')->get();

INSERT INTO `categories` (`name`, `updated_at`, `created_at`) VALUES ('Tyre', '2023-06-20 08:08:05', '2023-06-20 08:08:05')
---
    public function store(Request $request)
    {
        $attributes = request()->validate([
            'name' => 'required|max:255'
        ]);

        Category::create($attributes);