app/Http/Controllers/ProductController.php

SELECT * FROM `categories`
---
    public function index(Request $request)
    {
        $categoryID = $request->input('category_id');

        $heads = [
            'Product Name',
            'Category',
            ['label' => 'Edit', 'no-export' => true, 'width' => 5],
            ['label' => 'Delete', 'no-export' => true, 'width' => 5],
        ];

        $config = [
            'processing' => true,
            'serverSide' => true,
            'ajax' => [
                'url' => url('admin/products/dataTable'),
            ],
            'columns' => [
                ['data' => 'name', 'name' => 'name'],
                ['data' => 'category.name', 'name' => 'category.name'],
                ['data' => 'edit', 'name' => 'edit', 'orderable' => false, 'searchable' => false],
                ['data' => 'delete', 'name' => 'delete', 'orderable' => false, 'searchable' => false],
            ]
        ];

        $categories = Category::all();

SELECT * FROM `categories` WHERE `categories`.`id` in (1, 2)
SELECT `id`, `category_id`, `name` FROM `products` WHERE `category_id` = '3'
---
    public function dataTable(Request $request)
    {
        $categoryID = $request->input('category_id');

        $products = Product::with('category')
            ->when($categoryID, function ($query, $categoryID) {
                return $query->where('category_id', $categoryID);
            })
            ->select('id', 'category_id', 'name')
            ->get();

SELECT `name`, `id` FROM `categories`
---
    public function create(Request $request)
    {
        $categoryType = Category::pluck('name', 'id');

SELECT * FROM `categories` WHERE `categories`.`id` = '2' LIMIT 1
INSERT INTO `products` (`category_id`, `name`, `updated_at`, `created_at`) VALUES (2, 'Castrol', '2023-06-20 08:54:31', '2023-06-20 08:54:31')
---
    public function store(Request $request)
    {
        $attributes = $request->validate([
            'category_id' => 'required',
            'name' => 'required|max:255',
        ]);

        $category = Category::findOrFail($request->get('category_id'));
        $category->products()->create($attributes);

SELECT `name`, `id` FROM `categories`
---
    public function edit(Product $product)
    {
        $categoryID = $product->category_id;

        $categoryType = Category::pluck('name', 'id');

DELETE FROM `products` WHERE `id` = 3
---
    public function destroy(Product $product)
    {
        $product->delete();