app/Http/Controllers/UserController.php

SELECT `type`, `id` FROM `user_types`
---
    public function create()
    {
        $type = UserType::pluck('type', 'id');

SELECT * FROM `user_types` WHERE `user_types`.`id` in (1, 2)
SELECT `id`, `user_type_id`, `name`, `email` FROM `users`
---
    public function dataTable()
    {
        $users = User::with('type')->select('id','user_type_id', 'name', 'phone_number', 'email', 'verified')->get();